tutorials/rhoDarcyFoam/2DrandomKSource/Allrun
#!/bin/bash

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh
runApplication topoSet
runApplication setsToZones
runApplication setRandomField
runApplication rhoDarcyFoam
