tutorials/rhoDarcyFoam/2DrandomKSource/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    well;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (1.45 0.2 0) (1.55 0.4 1); // Edit box bounds as required
        }
    }
);

// ************************************************************************* //
